{
　　 有三个小朋友甲乙丙。甲有50粒糖果，乙有43粒糖果，两有13粒糖果。现在他们做一个游戏。从甲开始，将自己的糖分三份，自己留一份，其余两份分别给乙与丙，多余的糖果自己吃掉，然�
�乙与丙也依次这样做。问最后甲、乙、丙三人各有书多少粒糖果？

分析：
　　 这个问题中我们关心的是在游戏过程中每个小朋友的糖果个数，且他们所拥有的的糖果数是在变化的。因此可用a,b,c三个变量分别存放甲乙丙三个小朋友在某一时刻所拥有的糖果数。对于每
人，分糖后，他的糖果数一定为原来的糖果数 div 3（因为分糖过程糖果的数目不一定都刚好分完，用整除恰恰可以表示多余的糖自己吃掉）。而其他两人则增加与这个小朋友现在拥有的一样的糖
果。
}
program ex2;
var
  A,B,C:integer;
begin
  A:=50;B:=43;C:=13; {初始时每个小朋友所拥有的糖果数}
  A:=A div 3; B:=B+A;C:=C+A;  {甲小朋友分糖果后，每个人拥有的糖果数变化情况}
  B:=B div 3; A:=A+B;C:=C+B;  {乙小朋友分糖果后，每个人拥有的糖果数变化情况}
  C:=C div 3; A:=A+C;B:=B+C;  {丙小朋友分糖果后，每个人拥有的糖果数变化情况}
  writeln('A=',A,'B=',B,'C=',C); {输出结果}
  readln;
end.
